In [1]:
import pandas as pd
array = [2, 4, 6, 8, 10, 12]
series_obj = pd.Series(array)
arr = series_obj.values
arr

array([ 2,  4,  6,  8, 10, 12], dtype=int64)

In [3]:
reshaped_arr = arr.reshape((3, 2))
# show
reshaped_arr

array([[ 2,  4],
       [ 6,  8],
       [10, 12]], dtype=int64)

In [16]:
import pandas as pd
array = ["Amrit","Shrinivas",
         "Surya","Dikesh",
        "Ram","Pooja"]
series_obj = pd.Series(array)
print("Given Series:\n", series_obj)
arr = series_obj.values
arr

Given Series:
 0        Amrit
1    Shrinivas
2        Surya
3       Dikesh
4          Ram
5        Pooja
dtype: object

array(['Amrit', 'Shrinivas', 'Surya', 'Dikesh', 'Ram', 'Pooja'],
      dtype=object)

In [17]:
reshaped_arr = arr.reshape((2,3))
print("After Reshaping:\n", reshaped_arr)

After Reshaping:
 [['Amrit' 'Shrinivas' 'Surya']
 ['Dikesh' 'Ram' 'Pooja']]

In [18]:
import pandas as pd 
df = pd.DataFrame({'A':['Joni','Sukumar','Mohan'],
                   'B': ['Master','Graduate','Graduate'],
                   'C': [23,26,19]})
df

         A         B   C
0     Joni    Master  23
1  Sukumar  Graduate  26
2    Mohan  Graduate  19

In [23]:
df.pivot(index = 'A', columns = 'B', values = ['C', 'A'])

               C               A
B       Graduate Master Graduate Master
A
Joni         NaN     23      NaN   Joni
Mohan         19    NaN    Mohan    NaN
Sukumar       26    NaN  Sukumar    NaN

In [32]:
import pandas as pd 
df = pd.DataFrame({'Name':['Sunny', 'Monika', 'Deni', 'Jolly', 'Deepak'],
                           'Gender':['Female','Female','Female','Male','Male'],
                           'Age':[27,23,35,43,21]})
print("Dataset")
print(df)
print("-"*33)
                    
def age_bucket(age):
    if age <= 18:
        return "<18"
    else:
        return ">18"
df['Age Group'] = df['Age'].apply(age_bucket)
                           
gender = pd.DataFrame(df.Gender.value_counts(normalize = True)*100).reset_index()
gender.columns = ['Gender', '%Gender']
df=pd.merge(left=df, right=gender, how='inner', on=['Gender'])
table = pd.pivot_table(df, index = ['Gender', '%Gender', 'Age Group'],
                      values = ['Name'], aggfunc = {'Name': 'count',})
print("Table")
print(table)

Dataset
     Name  Gender  Age
0   Sunny  Female   27
1  Monika  Female   23
2    Deni  Female   35
3   Jolly    Male   43
4  Deepak    Male   21
---------------------------------
Table
                          Name
Gender %Gender Age Group
Female 60.0    >18           3
Male   40.0    >18           2